In [1]:
import pandas as pd
import numpy as np
import itertools

In [2]:
FARES_READING = r'C:\Users\ASUS\OneDrive\Semester 3\Innovation Project\Assign_02\fares_reading.csv'
FARES_WITH_DISTANCE = r'C:\Users\ASUS\OneDrive\Semester 3\Innovation Project\Assign_02\fares_with_distance.csv'

In [3]:
fares_reading = pd.read_csv(FARES_READING)
fares_with_distance = pd.read_csv(FARES_WITH_DISTANCE)

In [4]:
fares_with_distance.columns

Index(['Year', 'Month', 'Distance_GC_(km)', 'Arriving_Port', 'Departing_Port'], dtype='object')

In [5]:
# Make Arriving_Port and Departing_Port for fares_with_distance match capitalisation of fares_reading
#fares_with_distance["Arriving_Port"] = fares_with_distance["Arriving_Port"].str.title()
#fares_with_distance["Departing_Port"] = fares_with_distance["Departing_Port"].str.title()

In [6]:
# Source: https://stackoverflow.com/a/41815118

fares_reading = fares_reading[['Departing_Port', 'Arriving_Port', 'Month', 'Year', 'Average_Fare']]
fares_with_distance = fares_with_distance[['Year', 'Month', 'Arriving_Port', 'Departing_Port']]

combined_fares_data = pd.merge(
    left=fares_reading,
    right=fares_with_distance,
    how='outer',
    left_on=['Departing_Port', 'Arriving_Port', 'Month', 'Year'],
    right_on=['Departing_Port', 'Arriving_Port', 'Month', 'Year'],
)

In [7]:
combined_fares_data

      Departing_Port Arriving_Port  Month  Year  Average_Fare
0           Adelaide      Brisbane      8  2010         157.0
1           Adelaide      Canberra      8  2010         350.0
2           Adelaide    Gold Coast      8  2010         232.0
3           Adelaide     Melbourne      8  2010          87.0
4           Adelaide         Perth      8  2010         406.0
...              ...           ...    ...   ...           ...
22886         Sydney    Townsville     11  2023           NaN
22887         Sydney      Tamworth     12  2023           NaN
22888         Sydney    Townsville     12  2023           NaN
22889         Sydney      Tamworth      1  2024           NaN
22890         Sydney    Townsville      1  2024           NaN

[22891 rows x 5 columns]

In [8]:
combined_fares_data

      Departing_Port Arriving_Port  Month  Year  Average_Fare
0           Adelaide      Brisbane      8  2010         157.0
1           Adelaide      Canberra      8  2010         350.0
2           Adelaide    Gold Coast      8  2010         232.0
3           Adelaide     Melbourne      8  2010          87.0
4           Adelaide         Perth      8  2010         406.0
...              ...           ...    ...   ...           ...
22886         Sydney    Townsville     11  2023           NaN
22887         Sydney      Tamworth     12  2023           NaN
22888         Sydney    Townsville     12  2023           NaN
22889         Sydney      Tamworth      1  2024           NaN
22890         Sydney    Townsville      1  2024           NaN

[22891 rows x 5 columns]

## Get the name of all airports in our dataset

In [9]:
airports = np.unique(np.array([np.unique(combined_fares_data["Departing_Port"]), np.unique(combined_fares_data["Arriving_Port"])]).flatten())

In [10]:
airports

array(['Adelaide', 'Albury', 'Alice Springs', 'Armidale', 'Ayers Rock',
       'Ballina', 'Brisbane', 'Broome', 'Bundaberg', 'Burnie', 'Cairns',
       'Canberra', 'Coffs Harbour', 'Darwin', 'Devonport', 'Dubbo',
       'Emerald', 'Geraldton', 'Gladstone', 'Gold Coast',
       'Hamilton Island', 'Hervey Bay', 'Hobart', 'Kalgoorlie',
       'Karratha', 'Launceston', 'Mackay', 'Melbourne', 'Mildura',
       'Moranbah', 'Mount Isa', 'Newcastle', 'Newman', 'Perth',
       'Port Hedland', 'Port Lincoln', 'Port Macquarie', 'Proserpine',
       'Rockhampton', 'Sunshine Coast', 'Sydney', 'Tamworth',
       'Townsville', 'Wagga Wagga'], dtype=object)

## Load a dataset containing the location of all of our airports

In [11]:
distances_file = pd.read_csv("australian_air_distances_updated.csv")

In [12]:
distances_file.head()

,A NAME,A CODE,A LAT DEG,A LAT MIN,A LAT SEC,A LAT DIR,A LONG DEG,A LONG MIN,A LONG SEC,A LONG DIR,...,B LAT MIN,B LAT SEC,B LAT DIR,B LONG DEG,B LONG MIN,B LONG SEC,B LONG DIR,DIST KM,DIST NM,DIST SM
0,Abu Dhabi,AUH,24,26,0,N,54,39,0,E,...,56,47,S,138,31,46,E,11018,5945,6846
1,Abu Dhabi,AUH,24,26,0,N,54,39,0,E,...,23,9,S,153,6,59,E,12018,6485,7468
2,Abu Dhabi,AUH,24,26,0,N,54,39,0,E,...,40,29,S,144,50,32,E,11657,6290,7243
3,Abu Dhabi,AUH,24,26,0,N,54,39,0,E,...,56,29,S,115,57,55,E,9035,4875,5614
4,Abu Dhabi,AUH,24,26,0,N,54,39,0,E,...,56,51,S,151,10,34,E,12068,6512,7499

There are two airports which have different names in the locations
dataset compared to our dataset, so we must replace them

In [13]:
airports

array(['Adelaide', 'Albury', 'Alice Springs', 'Armidale', 'Ayers Rock',
       'Ballina', 'Brisbane', 'Broome', 'Bundaberg', 'Burnie', 'Cairns',
       'Canberra', 'Coffs Harbour', 'Darwin', 'Devonport', 'Dubbo',
       'Emerald', 'Geraldton', 'Gladstone', 'Gold Coast',
       'Hamilton Island', 'Hervey Bay', 'Hobart', 'Kalgoorlie',
       'Karratha', 'Launceston', 'Mackay', 'Melbourne', 'Mildura',
       'Moranbah', 'Mount Isa', 'Newcastle', 'Newman', 'Perth',
       'Port Hedland', 'Port Lincoln', 'Port Macquarie', 'Proserpine',
       'Rockhampton', 'Sunshine Coast', 'Sydney', 'Tamworth',
       'Townsville', 'Wagga Wagga'], dtype=object)

In [14]:
def location_decimal_to_degrees(degrees, minutes, seconds, direction, is_latitude):

    positive_direction = "N" if is_latitude else "E"
    sign = (1 if direction == positive_direction else -1)

    decimal = (degrees + minutes / 60. + seconds / 3600.) * sign

    return decimal

In [15]:
location_decimal_to_degrees(34, 56, 47, "S", True)

-34.94638888888888

In [16]:
# There are two airports which are referred to by different
# names in the distances dataset compared to ours, so we
# will need to translate them to get the relevant data.
name_replacements = {
    "Newcastle" : "Newcastle Seaplane",
    "Sunshine Coast" : "Maroochydore"
}

airport_latitudes = []
airport_longitudes = []
airport_codes = []

for airport in airports:
    #print(airport)

    airport_name = airport
    if airport_name in name_replacements:
        airport_name = name_replacements[airport_name]

    # Get the entry in australian_air_distances_updated that matches our airport.
    try:
        data = distances_file.loc[distances_file["A NAME"] == airport_name].iloc[0]

        # Set the following four variables to the airport's latitude in degrees/minutes/seconds format
        # We will convert this to decimal
        lat_deg, lat_min, lat_sec, lat_dir = data["A LAT DEG"], data["A LAT MIN"], data["A LAT SEC"], data["A LAT DIR"]

        long_deg, long_min, long_sec, long_dir = data["A LONG DEG"], data["A LONG MIN"], data["A LONG SEC"], data["A LONG DIR"]

        # Convert location (latitude and longitude) into decimal format
        latitude = location_decimal_to_degrees(lat_deg, lat_min, lat_sec, lat_dir, True)

        longitude = location_decimal_to_degrees(long_deg, long_min, long_sec, long_dir, False)

        airport_latitudes.append(latitude)
        airport_longitudes.append(longitude)
        airport_codes.append(data["A CODE"])
    except Exception:
        print(f"Airport {airport} not included in dataset")

airport_locations = pd.DataFrame({
    "name" : airports,
    "code" : airport_codes,
    "latitude" : airport_latitudes,
    "longitude" : airport_longitudes
})

airport_locations

               name code   latitude   longitude
0          Adelaide  ADL -34.946389  138.529444
1            Albury  ABX -36.068889  146.956389
2     Alice Springs  ASP -23.808333  133.900833
3          Armidale  ARM -30.530000  151.617500
4        Ayers Rock  AYQ -25.186944  130.973889
5           Ballina  QNA -28.836111  153.561389
6          Brisbane  BNE -27.385833  153.116389
7            Broome  BME -17.946111  122.230556
8         Bundaberg  BDB -24.905278  152.317500
9            Burnie  WNY -41.000278  145.730000
10           Cairns  CNS -16.887500  145.753611
11         Canberra  CBR -35.308333  149.193889
12    Coffs Harbour  CFS -30.321944  153.115556
13           Darwin  DRW -12.416111  130.875556
14        Devonport  DPO -41.171667  146.428889
15            Dubbo  DBO -32.218333  148.573611
16          Emerald  EMD -23.567500  148.180556
17        Geraldton  GET -28.797500  114.706111
18        Gladstone  GLT -23.871389  151.221667
19       Gold Coast  OOL -28.166111  153.503611
20  Hamilton Island  HTI -20.359722  148.950556
21       Hervey Bay  HVB -25.320556  152.879444
22           Hobart  HBA -42.837778  147.508889
23       Kalgoorlie  KGI -30.790833  121.461389
24         Karratha  KTA -20.713611  116.771944
25       Launceston  LST -41.545556  147.214167
26           Mackay  MKY -21.173056  149.178611
27        Melbourne  MEL -37.674722  144.842222
28          Mildura  MQL -34.230833  142.084167
29         Moranbah  MOV -22.066667  148.083333
30        Mount Isa  ISA -20.665278  139.487500
31        Newcastle  PHJ -32.925000  151.783333
32           Newman  ZNE -23.419167  119.801389
33            Perth  PER -31.941389  115.965278
34     Port Hedland  PHE -20.379167  118.625278
35     Port Lincoln  PLO -34.606944  135.878889
36   Port Macquarie  PQQ -31.437778  152.863611
37       Proserpine  PPP -20.496667  148.551389
38      Rockhampton  ROK -23.383333  150.474167
39   Sunshine Coast  MCY -26.604167  153.090000
40           Sydney  SYD -33.947500  151.176111
41         Tamworth  TMW -31.085278  150.845556
42       Townsville  TSV -19.254167  146.764167
43      Wagga Wagga  WGA -35.166944  147.465278

In [17]:
airport_locations.to_csv("airport_locations.csv")

In [18]:
distances_file.loc[distances_file["A NAME"] == "Adelaide"].iloc[0]

A NAME        Adelaide
A CODE             ADL
A LAT DEG           34
A LAT MIN           56
A LAT SEC           47
A LAT DIR            S
A LONG DEG         138
A LONG MIN          31
A LONG SEC          46
A LONG DIR           E
B NAME          Albury
B CODE             ABX
B LAT DEG           36
B LAT MIN            4
B LAT SEC            8
B LAT DIR            S
B LONG DEG         146
B LONG MIN          57
B LONG SEC          23
B LONG DIR           E
DIST KM            774
DIST NM            418
DIST SM            481
Name: 6, dtype: object

In [19]:
distances_file

,A NAME,A CODE,A LAT DEG,A LAT MIN,A LAT SEC,A LAT DIR,A LONG DEG,A LONG MIN,A LONG SEC,A LONG DIR,...,B LAT MIN,B LAT SEC,B LAT DIR,B LONG DEG,B LONG MIN,B LONG SEC,B LONG DIR,DIST KM,DIST NM,DIST SM
0,Abu Dhabi,AUH,24,26,0,N,54,39,0,E,...,56,47,S,138,31,46,E,11018,5945,6846
1,Abu Dhabi,AUH,24,26,0,N,54,39,0,E,...,23,9,S,153,6,59,E,12018,6485,7468
2,Abu Dhabi,AUH,24,26,0,N,54,39,0,E,...,40,29,S,144,50,32,E,11657,6290,7243
3,Abu Dhabi,AUH,24,26,0,N,54,39,0,E,...,56,29,S,115,57,55,E,9035,4875,5614
4,Abu Dhabi,AUH,24,26,0,N,54,39,0,E,...,56,51,S,151,10,34,E,12068,6512,7499
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5631,Williamtown,NTL,32,47,47,S,151,50,0,E,...,15,30,S,148,15,0,E,370,200,230
5632,Willowra,WLW,21,15,18,S,132,37,21,E,...,15,22,S,131,46,50,E,141,76,88
5633,Wiluna,WUN,26,38,7,S,120,13,15,E,...,22,0,S,116,39,0,E,402,217,250
5634,Wiluna,WUN,26,38,7,S,120,13,15,E,...,17,0,S,120,5,0,E,73,39,45
5635,Yam Island,YAM,9,54,0,S,142,46,0,E,...,44,0,S,143,25,0,E,74,40,46

In [20]:
combined_fares_data

      Departing_Port Arriving_Port  Month  Year  Average_Fare
0           Adelaide      Brisbane      8  2010         157.0
1           Adelaide      Canberra      8  2010         350.0
2           Adelaide    Gold Coast      8  2010         232.0
3           Adelaide     Melbourne      8  2010          87.0
4           Adelaide         Perth      8  2010         406.0
...              ...           ...    ...   ...           ...
22886         Sydney    Townsville     11  2023           NaN
22887         Sydney      Tamworth     12  2023           NaN
22888         Sydney    Townsville     12  2023           NaN
22889         Sydney      Tamworth      1  2024           NaN
22890         Sydney    Townsville      1  2024           NaN

[22891 rows x 5 columns]

In [21]:
# Source: https://medium.com/@petehouston/calculate-distance-of-two-locations-on-earth-using-python-1501b1944d97
from math import radians, degrees, sin, cos, asin, acos, sqrt
def great_circle_distance(lat1, lon1, lat2, lon2):
    lon1, lat1, lon2, lat2 = map(radians, [lon1, lat1, lon2, lat2])
    return 6371 * (
        acos(sin(lat1) * sin(lat2) + cos(lat1) * cos(lat2) * cos(lon1 - lon2))
    )

In [22]:
# For all airports in our combined_fares_data dataset,
# iterate through all rows of the data,
# and get the locations for the arriving and departing airport through
# cross-referencing our airport_locations dataset.

airport_distances = []

for fare_id, fare in combined_fares_data.iterrows():
    departing_port = fare["Arriving_Port"]
    arriving_port = fare["Departing_Port"]

    arriving_airport_data = airport_locations.loc[airport_locations["name"] == arriving_port]
    departing_airport_data = airport_locations.loc[airport_locations["name"] == departing_port]

    arriving_airport_latitude = arriving_airport_data["latitude"]
    arriving_airport_longitude = arriving_airport_data["longitude"]
    arriving_airport_code = arriving_airport_data["code"]

    departing_airport_latitude = departing_airport_data["latitude"]
    departing_airport_longitude = departing_airport_data["longitude"]
    departing_airport_code = departing_airport_data["code"]

    try:
        distance = great_circle_distance(arriving_airport_latitude, arriving_airport_longitude, departing_airport_latitude, departing_airport_longitude)
    except Exception as e:
        print(f"Error calculating great-circle distance between {departing_port} and {arriving_port}.")
        print(f"Row: {fare_id}")
        print(f"Departing airport location: {departing_airport_latitude}, {departing_airport_longitude}")
        print(f"Arriving airport location: {arriving_airport_latitude}, {arriving_airport_longitude}")
        print(f"Traceback:\n{str(e)}")

        break

    # print(arriving_airport_data)
    # print(departing_airport_data)
    # print(distance)

    airport_distances.append(distance)

In [23]:
combined_fares_data["Distance"] = airport_distances

In [24]:
combined_fares_data

      Departing_Port Arriving_Port  Month  Year  Average_Fare     Distance
0           Adelaide      Brisbane      8  2010         157.0  1619.982414
1           Adelaide      Canberra      8  2010         350.0   970.229046
2           Adelaide    Gold Coast      8  2010         232.0  1604.162840
3           Adelaide     Melbourne      8  2010          87.0   641.652927
4           Adelaide         Perth      8  2010         406.0  2115.440208
...              ...           ...    ...   ...           ...          ...
22886         Sydney    Townsville     11  2023           NaN  1691.132106
22887         Sydney      Tamworth     12  2023           NaN   319.769513
22888         Sydney    Townsville     12  2023           NaN  1691.132106
22889         Sydney      Tamworth      1  2024           NaN   319.769513
22890         Sydney    Townsville      1  2024           NaN  1691.132106

[22891 rows x 6 columns]

In [25]:
combined_fares_data.to_csv("fares_with_distance_fixed.csv", index=False)